satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Pre_Alpha/src/hw_config.c
  /* Enable the DMA1 Channel1 Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel1_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

  /* Enable the DMA1 Channel7 Interrupt */
  NVIC_InitStructure.NVIC_IRQChannel = DMA1_Channel7_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 3;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

  /* Enable the EXTI0 Interrupt (POWER key) */
  NVIC_InitStructure.NVIC_IRQChannel = EXTI0_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

  /* Enable the EXTI1 Interrupt (MENU key) */
  NVIC_InitStructure.NVIC_IRQChannel = EXTI1_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

  /* Enable the EXTI2 Interrupt (SEL key) */
  NVIC_InitStructure.NVIC_IRQChannel = EXTI2_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);    
 
  /* Enable the EXTI9_5 Interrupt (UP & DOWN key) */
  NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 3;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 2;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);
}

/*******************************************************************************
* Function Name  : GPIO_Configuration
* Description    : Configures the different GPIO ports.
* Input          : None
* Output         : None
* Return         : None
*******************************************************************************/
void GPIO_Configuration(void)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE); 
#ifdef USE_USB_HID
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_DISCONNECT, ENABLE);
#endif
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_POWER | RCC_APB2Periph_GPIO_MENU | RCC_APB2Periph_GPIO_SEL | 
                         RCC_APB2Periph_GPIO_UP | RCC_APB2Periph_GPIO_DOWN, ENABLE);   
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_VBAT_AIN | RCC_APB2Periph_GPIO_ECG_AIN, ENABLE);  
#ifdef USE_DAC_SIGNALGEN 
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_SIGNALGEN_AIN, ENABLE);  
#endif
#ifdef USE_DAC_VGND  
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_VGND_AOUT, ENABLE);   
#endif
#ifdef USE_DAC_IA_REF  
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_IA_REF_AOUT, ENABLE);   
#endif
#ifdef USE_DAC_SIGNALGEN 
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_SIGNALGEN_AOUT, ENABLE);  
#endif
#ifdef USE_BUZZER
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_BUZZER, ENABLE);
#endif
#ifdef USE_LED  
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_LED, ENABLE); 
#endif  
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_SHUTDOWN, ENABLE);   
#ifdef USE_ANALOG_POWER_SWITCH
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIO_ANALOG_POWER, ENABLE);   
#endif

#ifdef USE_USB_HID
#ifndef STM32F10X_CL 
  /* USB_DISCONNECT used as USB pull-up */
  GPIO_InitStructure.GPIO_Pin = USB_DISCONNECT_PIN;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
  GPIO_Init(USB_DISCONNECT, &GPIO_InitStructure); 
#endif /* STM32F10X_CL */ 
#endif

  /* Configure the Power key as input floating */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_POWER;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(GPIO_POWER, &GPIO_InitStructure);
 
  /* Configure the Menu key as IPD */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_MENU;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
  GPIO_Init(GPIO_MENU, &GPIO_InitStructure);
 
  /* Configure Sel Key as input floating */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_SEL;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
  GPIO_Init(GPIO_SEL, &GPIO_InitStructure);
  
  /* Configure the Up key as IPD */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_UP;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
  GPIO_Init(GPIO_UP, &GPIO_InitStructure);
  
  /* Configure the Down key as IPD */
  GPIO_InitStructure.GPIO_Pin = GPIO_Pin_DOWN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPD;
  GPIO_Init(GPIO_DOWN, &GPIO_InitStructure);
    
  /* Configure VBAT_AIN as analog input */
  GPIO_InitStructure.GPIO_Pin = GPIO_VBAT_AIN_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIO_VBAT_AIN, &GPIO_InitStructure);
 
  /* Configure ECG_AIN as analog input */ 
  GPIO_InitStructure.GPIO_Pin = GPIO_ECG_AIN_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIO_ECG_AIN, &GPIO_InitStructure);

#ifdef USE_DAC_SIGNALGEN 
  /* Configure SIGNALGEN_AIN as analog input */
  GPIO_InitStructure.GPIO_Pin = GPIO_SIGNALGEN_AIN_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIO_SIGNALGEN_AIN, &GPIO_InitStructure);
#endif  

#ifdef USE_DAC_VGND  
  /* Once the DAC channel is enabled, the corresponding GPIO pin is automatically 
     connected to the DAC converter. In order to avoid parasitic consumption, 
     the GPIO pin should be configured in analog */ 
  GPIO_InitStructure.GPIO_Pin = GPIO_VGND_AOUT_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIO_VGND_AOUT, &GPIO_InitStructure);
#endif

#ifdef USE_DAC_IA_REF  
  /* Once the DAC channel is enabled, the corresponding GPIO pin is automatically 
     connected to the DAC converter. In order to avoid parasitic consumption, 
     the GPIO pin should be configured in analog */ 
  GPIO_InitStructure.GPIO_Pin = GPIO_IA_REF_AOUT_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIO_IA_REF_AOUT, &GPIO_InitStructure);
#endif    
 
