satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Pre_Alpha/src/hw_config.c
#ifdef USE_DAC_SIGNALGEN 
  /* Once the DAC channel is enabled, the corresponding GPIO pin is automatically 
     connected to the DAC converter. In order to avoid parasitic consumption, 
     the GPIO pin should be configured in analog */
  GPIO_InitStructure.GPIO_Pin = GPIO_SIGNALGEN_AOUT_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AIN;
  GPIO_Init(GPIO_SIGNALGEN_AOUT, &GPIO_InitStructure);
#endif  

#ifdef USE_BUZZER
  /* Configure the Buzzer IO as Output PP */
  GPIO_InitStructure.GPIO_Pin = GPIO_BUZZER_PIN ;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIO_BUZZER, &GPIO_InitStructure);
  // /* Turn on Buzzer */
  // GPIO_ResetBits(GPIO_BUZZER, GPIO_BUZZER_PIN);
  /* Turn off Buzzer */
  GPIO_SetBits(GPIO_BUZZER, GPIO_BUZZER_PIN);
#endif

#ifdef USE_LED
  /* Configure the LED1 & LED2 IOs as Output PP */
  GPIO_InitStructure.GPIO_Pin = GPIO_LED1_PIN | GPIO_LED2_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIO_LED, &GPIO_InitStructure);
  // /* Turn on LED2 */
  // GPIO_ResetBits(GPIO_LED, GPIO_LED2_PIN);
  /* Turn off LED2 */
  GPIO_SetBits(GPIO_LED, GPIO_LED2_PIN);
#endif
    
  /* Configure Shutdown Pin as output push-pull */
  GPIO_InitStructure.GPIO_Pin = GPIO_SHUTDOWN_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIO_SHUTDOWN, &GPIO_InitStructure);

#ifdef USE_ANALOG_POWER_SWITCH
  /* Configure Analog Power Switch Pin as output push-pull */
  GPIO_InitStructure.GPIO_Pin = GPIO_ANALOG_POWER_PIN;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIO_ANALOG_POWER, &GPIO_InitStructure);
#endif
}

/*******************************************************************************
* Function Name : EXTI_Configuration.
* Description   : Configure the EXTI lines.
* Input         : None.
* Output        : None.
* Return value  : The direction value.
*******************************************************************************/
void EXTI_Configuration()
{
  EXTI_InitTypeDef EXTI_InitStructure;
  
  /* Connect Keys/Buttons to the corresponding EXTI lines */
  GPIO_EXTILineConfig(GPIO_POWER_PORTSOURCE, GPIO_POWER_PINSOURCE);
  GPIO_EXTILineConfig(GPIO_MENU_PORTSOURCE, GPIO_MENU_PINSOURCE);
  GPIO_EXTILineConfig(GPIO_SEL_PORTSOURCE, GPIO_SEL_PINSOURCE);
  GPIO_EXTILineConfig(GPIO_UP_PORTSOURCE, GPIO_UP_PINSOURCE);
  GPIO_EXTILineConfig(GPIO_DOWN_PORTSOURCE, GPIO_DOWN_PINSOURCE);

  /* Clear the POWER key EXTI line interrupt pending bit */
  EXTI_ClearITPendingBit(GPIO_POWER_EXTI_Line);

  /* Configure POWER key EXTI line to generate an interrupt on rising edge */  
  EXTI_InitStructure.EXTI_Line = GPIO_POWER_EXTI_Line;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;    //EXTI_Trigger_Rising_Falling
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);
  
  /* Enable the EXTI Line17 Interrupt - wakeup from Stop mode via RTCAlarm interrupt */ 
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Line = EXTI_Line17;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure); 
}

/*******************************************************************************
* Function Name  : IntExtOnOffConfig
* Description    : Enables or disables EXTI for the menu navigation keys :
*                  EXTI lines corresponding to "MENU", "SEL", "UP" and "DOWN".
* Input          : NewState: New state of the navigation keys. This parameter
*                  can be: ENABLE or DISABLE.
* Output         : None
* Return         : None
*******************************************************************************/
void IntExtOnOffConfig(FunctionalState NewState)
{
  EXTI_InitTypeDef EXTI_InitStructure;

  /* Initializes the EXTI_InitStructure */
  EXTI_StructInit(&EXTI_InitStructure);

  /* Disable the MENU, SEL, UP & DOWN EXTI lines */
  if(NewState == DISABLE)
  {
    EXTI_InitStructure.EXTI_Line = GPIO_MENU_EXTI_Line | GPIO_SEL_EXTI_Line | GPIO_UP_EXTI_Line | GPIO_DOWN_EXTI_Line;
    EXTI_InitStructure.EXTI_LineCmd = DISABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
  /* Enable the MENU, SEL, UP & DOWN EXTI lines on rising edge */
  else
  {
    /* Clear the MENU, SEL, UP & DOWN EXTI lines interrupt pending bit */
    EXTI_ClearITPendingBit(GPIO_MENU_EXTI_Line | GPIO_SEL_EXTI_Line | GPIO_UP_EXTI_Line | GPIO_DOWN_EXTI_Line);

    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Line = GPIO_MENU_EXTI_Line | GPIO_SEL_EXTI_Line | GPIO_UP_EXTI_Line | GPIO_DOWN_EXTI_Line;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);
  }
}

// /**
  // * @brief  Configures the RTC.
  // * @param  None
  // * @retval None
  // */
// void RTC_Configuration(void)
// {
  // /* Enable PWR and BKP clocks */
  // RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR | RCC_APB1Periph_BKP, ENABLE);

  // /* Allow access to BKP Domain */
  // PWR_BackupAccessCmd(ENABLE);

  // /* Reset Backup Domain */
  // BKP_DeInit();

  // /* Enable LSE */
  // RCC_LSEConfig(RCC_LSE_ON);
  // /* Wait till LSE is ready */
  // while (RCC_GetFlagStatus(RCC_FLAG_LSERDY) == RESET)
  // {}

  // /* Select LSE as RTC Clock Source */
  // RCC_RTCCLKConfig(RCC_RTCCLKSource_LSE);

  // /* Enable RTC Clock */
  // RCC_RTCCLKCmd(ENABLE);

  // /* Wait for RTC registers synchronization */
  // RTC_WaitForSynchro();

  // /* Wait until last write operation on RTC registers has finished */
  // RTC_WaitForLastTask();

  // /* Enable the RTC Second */
  // RTC_ITConfig(RTC_IT_SEC, ENABLE);

  // /* Wait until last write operation on RTC registers has finished */
  // RTC_WaitForLastTask();

  // /* Set RTC prescaler: set RTC period to 1sec */
  // RTC_SetPrescaler(32767); /* RTC period = RTCCLK/RTC_PR = (32.768 KHz)/(32767+1) */

  // /* Wait until last write operation on RTC registers has finished */
  // RTC_WaitForLastTask();
// }

/**
  * @brief  Configure a SysTick Base time to 10 ms.
  * @param  None
  * @retval None
  */
void SysTick_Configuration(void)
{
  /* Setup SysTick Timer for 10 msec interrupts  */
  if (SysTick_Config(SystemCoreClock / 100))    //1000 for 1 msec
  {
    /* Capture error */
    while (1);
  }

  // /* Configure the SysTick handler priority */
  // NVIC_SetPriority(SysTick_IRQn, 0x0);
  /* Set SysTick interrupt vector Preemption Priority to 0 & Subpriority to 1 */
  NVIC_SetPriority(SysTick_IRQn, NVIC_EncodePriority(NVIC_GetPriorityGrouping(),0,1));
}

/**
  * @brief  Inserts a delay time.
  * @param  nCount: specifies the delay time length (time base 10 ms).
  * @retval None
  */
void Delay(__IO uint32_t nCount)
{
    TimingDelay = nCount;

    // /* Enable the SysTick Counter */
    // SysTick->CTRL |= SysTick_CTRL_ENABLE;

    while(TimingDelay != 0);

    // /* Disable the SysTick Counter */
    // SysTick->CTRL &= ~SysTick_CTRL_ENABLE;

    // /* Clear the SysTick Counter */
    // SysTick->VAL = (uint32_t)0x0;
}

