satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Pre_Alpha/src/hw_config.c
        /* Clear the DMA1 Channel1 Half Transfer & Transfer complete Flag */
        DMA_ClearFlag(DMA1_FLAG_HT1 | DMA1_FLAG_TC1);

        /* Enable DMA1 channel1 */
        DMA_Cmd(DMA1_Channel1, ENABLE);

        /* ADC1 configuration ------------------------------------------------------*/
        ADC_InitStructure.ADC_Mode = ADC_Mode_Independent;
        ADC_InitStructure.ADC_ScanConvMode = ENABLE;
        ADC_InitStructure.ADC_ContinuousConvMode = DISABLE;
        ADC_InitStructure.ADC_ExternalTrigConv = ADC_ExternalTrigConv_T3_TRGO;
        ADC_InitStructure.ADC_DataAlign = ADC_DataAlign_Right;
        ADC_InitStructure.ADC_NbrOfChannel = DATA_CHANNELS;
        ADC_Init(ADC1, &ADC_InitStructure);

        /* ADC1 regular channels configuration */ 
        for(Data_Channel_Index = 0; Data_Channel_Index < DATA_CHANNELS; Data_Channel_Index++)
        {
            ADC_RegularChannelConfig(ADC1, Data_Channel[Data_Channel_Index], Data_Channel_Index + 1, ADC_SampleTime_1Cycles5);
#ifdef USE_ADC_ANALOGWATCHDOG
            if(Data_Channel[Data_Channel_Index] == VBAT_AIN_CHANNEL)
            {
                /* Configure high and low analog watchdog thresholds */
                ADC_AnalogWatchdogThresholdsConfig(ADC1, ANALOGWATCHDOG_HIGH_THRESHOLD, ANALOGWATCHDOG_LOW_THRESHOLD);
                /* Configure VBAT_AIN_CHANNEL as the single analog watchdog guarded channel */
                ADC_AnalogWatchdogSingleChannelConfig(ADC1, VBAT_AIN_CHANNEL);
                /* Enable analog watchdog on one regular channel */
                ADC_AnalogWatchdogCmd(ADC1, ADC_AnalogWatchdog_SingleRegEnable);

                /* Enable ADC1 AWD interupt */
                ADC_ITConfig(ADC1, ADC_IT_AWD, ENABLE);
            }
#endif        
        }

        /* Enable ADC1 DMA */
        ADC_DMACmd(ADC1, ENABLE);

        /* Enable ADC1 external trigger */
        ADC_ExternalTrigConvCmd(ADC1, ENABLE);

        /* Enable ADC1 */
        ADC_Cmd(ADC1, ENABLE);

        /* Enable ADC1 reset calibaration register */   
        ADC_ResetCalibration(ADC1);
        
        /* Check the end of ADC1 reset calibration register */
        while(ADC_GetResetCalibrationStatus(ADC1));

        /* Start ADC1 calibaration */
        ADC_StartCalibration(ADC1);

        /* Check the end of ADC1 calibration */
        while(ADC_GetCalibrationStatus(ADC1));  

        /* TIM3 enable counter */
        TIM_Cmd(TIM3, ENABLE);
    }
    else
    {
        /* TIM3 disable counter */
        TIM_Cmd(TIM3, DISABLE);

        /* Disable ADC1 */
        ADC_Cmd(ADC1, DISABLE);

        /* Disable ADC1 external trigger */
        ADC_ExternalTrigConvCmd(ADC1, DISABLE);

        /* Disable ADC1 DMA */
        ADC_DMACmd(ADC1, DISABLE);

        /* Disable DMA1 channel1 */
        DMA_Cmd(DMA1_Channel1, DISABLE);

        /* Disable the DMA1 Channel1 Half Transfer & Transfer complete interrupt */
        DMA_ITConfig(DMA1_Channel1, DMA_IT_HT | DMA_IT_TC, DISABLE);
    
        /* Clear the DMA1 Channel1 Half Transfer & Transfer complete Flag */
        DMA_ClearFlag(DMA1_FLAG_HT1 | DMA1_FLAG_TC1);    

        /* Disable TIM3 clock */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3, DISABLE);

        /* Disable ADC1 clock */
        RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, DISABLE);

        /* Disable DMA1 clock */
        // RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, DISABLE);    
    }
}

/*******************************************************************************
* Function Name : MEM_DMA_TIM_Configuration.
* Description   : Configure the TIM and DMA for playing Data log file from SDCard
* Input         : NewState: new state.
* Output        : None.
* Return value  : The direction value.
*******************************************************************************/
void MEM_DMA_TIM_Configuration(FunctionalState NewState)
{
    if(NewState == ENABLE)
    {  
        DMA_InitTypeDef DMA_InitStructure;

        uint16_t TIM4_Prescaler = 0;
        uint16_t TIM4_Autoreload = 0;
    
        /* Enable DMA1 clock */
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);

        /* Enable TIM4 clock */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, ENABLE);

        /* TIM4 Configuration */
        /* TIM4 Update Frequency = 72000000/7200/80 = 125Hz */
        /* TIM4 Update Frequency = 72000000/7200/40 = 250Hz */
        /* TIM4 Update Frequency = 72000000/7200/20 = 500Hz */
        /* TIM4 Update Frequency = 72000000/7200/10 = 1000Hz */
        /* TIM4_Prescaler: 7199 */
        /* TIM4_Autoreload: 79->125Hz, 39->250Hz, 19->500Hz, 9->1000Hz */
        /* Time base configuration */
        // TIM_TimeBaseInitTypeDef   TIM_TimeBaseStructure;
        // TIM_TimeBaseStructInit(&TIM_TimeBaseStructure); 
        // TIM_TimeBaseStructure.TIM_Prescaler = TIM4_Prescaler;       
        // TIM_TimeBaseStructure.TIM_Period = TIM4_Autoreload;          
        // TIM_TimeBaseStructure.TIM_ClockDivision = 0x0;    
        // TIM_TimeBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;  
        // TIM_TimeBaseInit(TIM4, &TIM_TimeBaseStructure); 
        TIM4_Prescaler = (SystemCoreClock / 10000) - 1;
        TIM4_Autoreload = (10000 / (ADC_Sampling_Freq * DATA_CHANNELS)) - 1;
        TIM_PrescalerConfig(TIM4, TIM4_Prescaler, TIM_PSCReloadMode_Update);
        TIM_SetAutoreload(TIM4, TIM4_Autoreload);

        /* DMA1 channel7 configuration ---------------------------------------------*/
        DMA_DeInit(DMA1_Channel7);
        DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&DATA_LOG_Read_Buff[0];
        DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)&DATA_Buff[0];
        DMA_InitStructure.DMA_BufferSize = DMA_DATA_BUFF_SIZE;
        DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
        DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Enable;
        DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
        DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
        DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
        DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
        DMA_InitStructure.DMA_Priority = DMA_Priority_High;
        DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
        DMA_Init(DMA1_Channel7, &DMA_InitStructure);

        /* Enable the DMA1 Channel7 Half Transfer & Transfer complete interrupt */
        DMA_ITConfig(DMA1_Channel7, DMA_IT_HT | DMA_IT_TC, ENABLE);

        /* Clear the DMA1 Channel7 Half Transfer & Transfer complete Flag */
        DMA_ClearFlag(DMA1_FLAG_HT7 | DMA1_FLAG_TC7);

