satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Pre_Alpha/src/hw_config.c
        /* Enable DMA1 channel7 */
        DMA_Cmd(DMA1_Channel7, ENABLE);

        /* TIM4 Update DMA Request enable */
        TIM_DMACmd(TIM4, TIM_DMA_Update, ENABLE);

        /* TIM4 enable counter */
        TIM_Cmd(TIM4, ENABLE);
    }
    else
    {
        /* TIM4 disable counter */
        TIM_Cmd(TIM4, DISABLE);

        /* TIM4 Update DMA Request disable */
        TIM_DMACmd(TIM4, TIM_DMA_Update, DISABLE);

        /* Disable DMA1 channel7 */
        DMA_Cmd(DMA1_Channel7, DISABLE);

        /* Disable the DMA1 Channel7 Half Transfer & Transfer complete interrupt */
        DMA_ITConfig(DMA1_Channel7, DMA_IT_HT | DMA_IT_TC, DISABLE);

        /* Clear the DMA1 Channel7 Half Transfer & Transfer complete Flag */
        DMA_ClearFlag(DMA1_FLAG_HT7 | DMA1_FLAG_TC7);

        /* Disable TIM4 clock */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM4, DISABLE);

        // /* Disable DMA1 clock */
        // RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, DISABLE);  
    }
}

#if defined (USE_DAC_VGND) || defined (USE_DAC_IA_REF)
void DAC_Configuration(FunctionalState NewState)
{
    if(NewState == ENABLE)
    {
        DAC_InitTypeDef DAC_InitStructure;
    
        /* DAC Periph clock enable */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);

        DAC_InitStructure.DAC_Trigger = DAC_Trigger_None;
        DAC_InitStructure.DAC_WaveGeneration = DAC_WaveGeneration_None;
        DAC_InitStructure.DAC_OutputBuffer = DAC_OutputBuffer_Enable;   //DAC_OutputBuffer_Disable;
#ifdef USE_DAC_VGND      
        DAC_Init(VGND_AOUT_CHANNEL, &DAC_InitStructure);
#endif
#ifdef USE_DAC_IA_REF      
        DAC_Init(IA_REF_AOUT_CHANNEL, &DAC_InitStructure);
#endif
        DAC_SetChannel1Data(DAC_Align_12b_R, DAC_Channel1_Data);
        
        /* Enable DAC Channel1: Once the DAC channel1 is enabled, PA.04 is 
         automatically connected to the DAC converter. */    
#ifdef USE_DAC_VGND      
        DAC_Cmd(VGND_AOUT_CHANNEL, ENABLE);  
#endif
#ifdef USE_DAC_IA_REF      
        DAC_Cmd(IA_REF_AOUT_CHANNEL, ENABLE);  
#endif
    }
    else
    {
        /* Disable DAC Channel1 */
#ifdef USE_DAC_VGND      
        DAC_Cmd(VGND_AOUT_CHANNEL, DISABLE);  
#endif
#ifdef USE_DAC_IA_REF      
        DAC_Cmd(IA_REF_AOUT_CHANNEL, DISABLE);  
#endif
        
        /* DAC Periph clock disable */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, DISABLE);    
    }
}
#endif

#ifdef USE_DAC_SIGNALGEN 
/*******************************************************************************
* Function Name : DAC_DMA_TIM_Configuration.
* Description   : Configure the DAC to generate Sine wave.
* Input         : NewState: new state.
* Output        : None.
* Return value  : The direction value.
*******************************************************************************/
void DAC_DMA_TIM_Configuration(FunctionalState NewState)
{
    if(NewState == ENABLE)
    {
        DAC_InitTypeDef DAC_InitStructure;
        DMA_InitTypeDef DMA_InitStructure;

        uint16_t TIM7_Prescaler = 0;
        uint16_t TIM7_Autoreload = 0;
    
#if !defined STM32F10X_LD_VL && !defined STM32F10X_MD_VL
        /* DMA2 clock enable */
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, ENABLE);
#else
        /* DMA1 clock enable */
        RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, ENABLE);
#endif

        /* DAC Periph clock enable */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, ENABLE);

        /* TIM7 Periph clock enable */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, ENABLE);

        /* TIM7 Configuration */
        /* Sine Wave Frequency/Sample Rate = 72000000/3750/150/128 = 1 Hz */
        /* TIM7_Prescaler: 3749 */
        /* TIM7_Autoreload: 149->1Hz, 0->150Hz */
        TIM7_Prescaler = (SystemCoreClock / DAC_NPT / 1000) - 1;
        TIM7_Autoreload = (1000 / SineFreqTable[SineFreqIndex]) - 1;        
        TIM_PrescalerConfig(TIM7, TIM7_Prescaler, TIM_PSCReloadMode_Update);
        TIM_SetAutoreload(TIM7, TIM7_Autoreload);

        /* TIM7 TRGO selection */
        TIM_SelectOutputTrigger(TIM7, TIM_TRGOSource_Update);

#if !defined STM32F10X_LD_VL && !defined STM32F10X_MD_VL
        /* DMA2 channel4 configuration */
        DMA_DeInit(DMA2_Channel4);
#else
        /* DMA1 channel4 configuration */
        DMA_DeInit(DMA1_Channel4);
#endif
        DMA_InitStructure.DMA_PeripheralBaseAddr = DAC_DHR12R2_Address;
        DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)&Sine12bit;
        DMA_InitStructure.DMA_BufferSize = DAC_NPT;
        DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
        DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
        DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
        DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_HalfWord;
        DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_HalfWord;
        DMA_InitStructure.DMA_Mode = DMA_Mode_Circular;
        DMA_InitStructure.DMA_Priority = DMA_Priority_High;
        DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
#if !defined STM32F10X_LD_VL && !defined STM32F10X_MD_VL
        DMA_Init(DMA2_Channel4, &DMA_InitStructure);
#else
        DMA_Init(DMA1_Channel4, &DMA_InitStructure);
#endif

#if !defined STM32F10X_LD_VL && !defined STM32F10X_MD_VL
        /* Enable DMA2 Channel4 */
        DMA_Cmd(DMA2_Channel4, ENABLE);
#else
        /* Enable DMA1 Channel4 */
        DMA_Cmd(DMA1_Channel4, ENABLE);
#endif

        /* DAC channel2 Configuration */
        DAC_InitStructure.DAC_Trigger = DAC_Trigger_T7_TRGO;
        DAC_InitStructure.DAC_WaveGeneration = DAC_WaveGeneration_None;
        DAC_InitStructure.DAC_OutputBuffer = DAC_OutputBuffer_Enable; //DAC_OutputBuffer_Disable;
        DAC_Init(SIGNALGEN_AOUT_CHANNEL, &DAC_InitStructure);

        /* Enable DAC Channel2: Once the DAC channel2 is enabled, PA.05 is 
        automatically connected to the DAC converter. */
        DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, ENABLE);

        /* Enable DMA for DAC Channel2 */
        DAC_DMACmd(SIGNALGEN_AOUT_CHANNEL, ENABLE);

        /* TIM7 enable counter */
        TIM_Cmd(TIM7, ENABLE);
    }
    else
    {
        /* TIM7 disable counter */
        TIM_Cmd(TIM7, DISABLE);

        /* Disable DMA for DAC Channel2 */
        DAC_DMACmd(SIGNALGEN_AOUT_CHANNEL, DISABLE);

        /* Disable DAC Channel2 */
        DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, DISABLE);

#if !defined STM32F10X_LD_VL && !defined STM32F10X_MD_VL
        /* Disable DMA2 Channel4 */
        DMA_Cmd(DMA2_Channel4, DISABLE);
#else
        /* Disable DMA1 Channel4 */
        DMA_Cmd(DMA1_Channel4, DISABLE);
#endif

        /* TIM7 Periph clock disable */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM7, DISABLE);

        /* DAC Periph clock disable */
        RCC_APB1PeriphClockCmd(RCC_APB1Periph_DAC, DISABLE);

// #if !defined STM32F10X_LD_VL && !defined STM32F10X_MD_VL
        // /* DMA2 clock disable */
        // RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA2, DISABLE);
// #else
        // /* DMA1 clock disable */
        // RCC_AHBPeriphClockCmd(RCC_AHBPeriph_DMA1, DISABLE);
// #endif
    }
}
#endif

