satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Pre_Alpha/src/hw_config.c
/*******************************************************************************
* Function Name  : Shutdown_System.
* Description    : Shutdown system.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void Shutdown_System(void)
{
    /* Unmount SDcard filesystem before shutting down */
    f_mount(0, NULL);   //unregister work area
    // GPIO_WriteBit(GPIO_SHUTDOWN, GPIO_SHUTDOWN_PIN, Bit_SET);
    GPIO_SetBits(GPIO_SHUTDOWN, GPIO_SHUTDOWN_PIN);
}

#ifdef USE_ANALOG_POWER_SWITCH
/*******************************************************************************
* Function Name : Analog_Power.
* Description   : Enable/Disable power for analog circuits(IA, OpAmps etc.).
* Input         : NewState: new state.
* Output        : None.
* Return value  : None.
*******************************************************************************/
void Analog_Power(FunctionalState NewState)
{
    if(NewState == ENABLE)
    {
        // GPIO_WriteBit(GPIO_ANALOG_POWER, GPIO_ANALOG_POWER_PIN, Bit_SET);
        GPIO_SetBits(GPIO_ANALOG_POWER, GPIO_ANALOG_POWER_PIN);
    }
    else
    {
        // GPIO_WriteBit(GPIO_ANALOG_POWER, GPIO_ANALOG_POWER_PIN, Bit_RESET);
        GPIO_ResetBits(GPIO_ANALOG_POWER, GPIO_ANALOG_POWER_PIN);    
    }
}
#endif

void EnterAutoShutdownMode_RTCAlarm(uint32_t AlarmTime)
{
    uint32_t tmp = 0;
    if(AlarmTime)
    {
        tmp = RTC_GetCounter();
        /* Wait until last write operation on RTC registers has finished */
        RTC_WaitForLastTask();
        /* Set RTC Alarm register with the new value */
        tmp += AlarmTime;
        if(tmp >= 86400)
            tmp = AlarmTime;
        RTC_SetAlarm(tmp);
        /* Wait until last write operation on RTC registers has finished */
        RTC_WaitForLastTask(); 
        AUTO_SHUTDOWN_ENABLED = 1;
    }    
    else
    {
        AUTO_SHUTDOWN_ENABLED = 0;
    }
}

#ifdef USE_IWDG 
void Enable_IWDG(void)
{
    /* IWDG timeout equal to 20 sec (the timeout may varies due to LSI frequency dispersion) */
    /* Enable write access to IWDG_PR and IWDG_RLR registers */
    IWDG_WriteAccessCmd(IWDG_WriteAccess_Enable);

    /* IWDG counter clock: 40KHz(LSI) / 256 = 156.25 Hz */
    IWDG_SetPrescaler(IWDG_Prescaler_256);

    /* Set counter reload value to 3124 */
    IWDG_SetReload(3124);

    /* Reload IWDG counter */
    IWDG_ReloadCounter();

    /* Enable IWDG (the LSI oscillator will be enabled by hardware) */
    IWDG_Enable();
}
#endif

#ifdef USE_USB_HID
// /*******************************************************************************
// * Function Name  : Get_SerialNum.
// * Description    : Create the serial number string descriptor.
// * Input          : None.
// * Output         : None.
// * Return         : None.
// *******************************************************************************/
// void Get_SerialNum(void)
// {
  // uint32_t Device_Serial0, Device_Serial1, Device_Serial2;
  
  // Device_Serial0 = *(uint32_t*)(0x1FFFF7E8);
  // Device_Serial1 = *(uint32_t*)(0x1FFFF7EC);
  // Device_Serial2 = *(uint32_t*)(0x1FFFF7F0);
  
  // if(Device_Serial0 != 0)
  // {
     // CustomHID_StringSerial[2] = (uint8_t)(Device_Serial0 & 0x000000FF);  
     // CustomHID_StringSerial[4] = (uint8_t)((Device_Serial0 & 0x0000FF00) >> 8);
     // CustomHID_StringSerial[6] = (uint8_t)((Device_Serial0 & 0x00FF0000) >> 16);
     // CustomHID_StringSerial[8] = (uint8_t)((Device_Serial0 & 0xFF000000) >> 24);  
     
     // CustomHID_StringSerial[10] = (uint8_t)(Device_Serial1 & 0x000000FF);  
     // CustomHID_StringSerial[12] = (uint8_t)((Device_Serial1 & 0x0000FF00) >> 8);
     // CustomHID_StringSerial[14] = (uint8_t)((Device_Serial1 & 0x00FF0000) >> 16);
     // CustomHID_StringSerial[16] = (uint8_t)((Device_Serial1 & 0xFF000000) >> 24); 
     
     // CustomHID_StringSerial[18] = (uint8_t)(Device_Serial2 & 0x000000FF);  
     // CustomHID_StringSerial[20] = (uint8_t)((Device_Serial2 & 0x0000FF00) >> 8);
     // CustomHID_StringSerial[22] = (uint8_t)((Device_Serial2 & 0x00FF0000) >> 16);
     // CustomHID_StringSerial[24] = (uint8_t)((Device_Serial2 & 0xFF000000) >> 24); 
  // }   
// }

/*******************************************************************************
* Function Name  : Get_SerialNum.
* Description    : Create the serial number string descriptor.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void Get_SerialNum(void)
{
  uint32_t Device_Serial0, Device_Serial1, Device_Serial2;

  Device_Serial0 = *(__IO uint32_t*)(0x1FFFF7E8);
  Device_Serial1 = *(__IO uint32_t*)(0x1FFFF7EC);
  Device_Serial2 = *(__IO uint32_t*)(0x1FFFF7F0);

  Device_Serial0 += Device_Serial2;

  if (Device_Serial0 != 0)
  {
    IntToUnicode (Device_Serial0, &CustomHID_StringSerial[2] , 8);
    IntToUnicode (Device_Serial1, &CustomHID_StringSerial[18], 4);
  }
}

/*******************************************************************************
* Function Name  : HexToChar.
* Description    : Convert Hex 32Bits value into char.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
static void IntToUnicode (uint32_t value , uint8_t *pbuf , uint8_t len)
{
  uint8_t idx = 0;
  
  for( idx = 0 ; idx < len ; idx ++)
  {
    if( ((value >> 28)) < 0xA )
    {
      pbuf[ 2* idx] = (value >> 28) + '0';
    }
    else
    {
      pbuf[2* idx] = (value >> 28) + 'A' - 10; 
    }
    
    value = value << 4;
    
    pbuf[ 2* idx + 1] = 0;
  }
}

#ifdef STM32F10X_CL
/*******************************************************************************
* Function Name  : USB_OTG_BSP_uDelay.
* Description    : provide delay (usec).
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void USB_OTG_BSP_uDelay (const uint32_t usec)
{
  RCC_ClocksTypeDef  RCC_Clocks;  

  /* Configure HCLK clock as SysTick clock source */
  SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK);
  
  RCC_GetClocksFreq(&RCC_Clocks);
  
  SysTick_Config(usec * (RCC_Clocks.HCLK_Frequency / 1000000));  
  
