satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Pre_Alpha/src/hw_config.c
  SysTick->CTRL  &= ~SysTick_CTRL_TICKINT_Msk ;
  
  while (!(SysTick->CTRL & SysTick_CTRL_COUNTFLAG_Msk));
}
#endif
#endif

#ifdef USE_USB_DFU
void DFU_Start(void)
{
    /* Clear LCD */
    LCD_Clear(LCD_COLOR_WHITE);        

    IntExtOnOffConfig(DISABLE);

    EnterAutoShutdownMode_RTCAlarm(DISABLE);

    while(Menu_ReadKey() != NOKEY)
    {
    } 

    LCD_DisplayStringLine(LCD_LINE_3, "        STM32       ");
    LCD_DisplayStringLine(LCD_LINE_4, "  Firmware Upgrade  ");

    BKP_WriteBackupRegister(BKP_DR10, 0xFFFF);
#ifdef USE_USB_HID
    USB_Cable_Config(DISABLE);
#endif
    NVIC_SystemReset();
}
#endif

#ifdef USE_USB_MSD
void MSD_Start(void)
{
    /* Clear LCD */
    LCD_Clear(LCD_COLOR_WHITE);        

    IntExtOnOffConfig(DISABLE);

    EnterAutoShutdownMode_RTCAlarm(DISABLE);

    while(Menu_ReadKey() != NOKEY)
    {
    } 

    LCD_DisplayStringLine(LCD_LINE_3, "        STM32       ");
    LCD_DisplayStringLine(LCD_LINE_4, "  USB Mass Storage  ");

    BKP_WriteBackupRegister(BKP_DR10, 0x4000);
#ifdef USE_USB_HID
    USB_Cable_Config(DISABLE);
#endif
    NVIC_SystemReset();
}
#endif

#ifdef USE_USB_VCP
void VCP_Start(void)
{
    /* Clear LCD */
    LCD_Clear(LCD_COLOR_WHITE);        

    IntExtOnOffConfig(DISABLE);

    EnterAutoShutdownMode_RTCAlarm(DISABLE);

    while(Menu_ReadKey() != NOKEY)
    {
    } 

    LCD_DisplayStringLine(LCD_LINE_3, "        STM32       ");
    LCD_DisplayStringLine(LCD_LINE_4, "   USB Virtual Com  ");

    BKP_WriteBackupRegister(BKP_DR10, 0x8000);
#ifdef USE_USB_HID
    USB_Cable_Config(DISABLE);
#endif
    NVIC_SystemReset();
}
#endif

void Test_FatFs(void)
{
  /* Clear LCD */
  LCD_Clear(LCD_COLOR_WHITE);        

  // /* Display text */
  // LCD_DisplayStringLine(LCD_LINE_0, "====================");
  // LCD_DisplayStringLine(LCD_LINE_1, " SDCard FatFs-R0.08 ");
  // LCD_DisplayStringLine(LCD_LINE_2, "===================="); 

  // disk_initialize(0); //initialize the disk hardware
  // /* mount filesystem, store in the instance you just made */
  // f_mount(0, &FATFS_Obj); 

  /* open file with write permission */
  res = f_open(&fil_obj, "log.txt", FA_CREATE_ALWAYS | FA_WRITE | FA_READ); 
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_0, "Open log.txt:Success"); 
  else
    LCD_DisplayStringLine(LCD_LINE_0, "Open log.txt:Failed "); 
  
  // /* write text to file */
  // res = f_printf(&fil_obj, "%s\n%s\n%s\n", MESSAGE1, MESSAGE2, MESSAGE3); 
  // if(res != EOF)
    // LCD_DisplayStringLine(LCD_LINE_X, "       Success       "); 
  // else
    // LCD_DisplayStringLine(LCD_LINE_X, "       Failed        "); 

  /* write to file */
  res = f_write(&fil_obj, MESSAGE1, strlen(MESSAGE1), &bytesWritten);
  // res = f_sync(&fil_obj);
  res = f_write(&fil_obj, MESSAGE2, strlen(MESSAGE2), &bytesWritten);
  // res = f_sync(&fil_obj);
  res = f_write(&fil_obj, MESSAGE3, strlen(MESSAGE3), &bytesWritten);
  // res = f_sync(&fil_obj);
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_1, "File Logging:Success"); 
  else
    LCD_DisplayStringLine(LCD_LINE_1, "File Logging:Failed "); 

  /* move to top of the file */
  res = f_lseek(&fil_obj, 0);
  // if(res == FR_OK)
    // LCD_DisplayStringLine(LCD_LINE_X, "Seek from 0 :Success"); 
  // else
    // LCD_DisplayStringLine(LCD_LINE_X, "Seek from 0 :Failed "); 
  
  /* read file */
  res = f_read(&fil_obj, fileReadBuffer, sizeof(fileReadBuffer), &bytesRead);
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_2, fileReadBuffer); 
  else
    LCD_DisplayStringLine(LCD_LINE_2, "File Reading:Failed "); 

  res = f_read(&fil_obj, fileReadBuffer, sizeof(fileReadBuffer), &bytesRead);
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_3, fileReadBuffer); 
  else
    LCD_DisplayStringLine(LCD_LINE_3, "File Reading:Failed "); 

  res = f_read(&fil_obj, fileReadBuffer, sizeof(fileReadBuffer), &bytesRead);
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_4, fileReadBuffer); 
  else
    LCD_DisplayStringLine(LCD_LINE_4, "File Reading:Failed "); 
  
  /* close the file, writes cached content to disk */
  res = f_close(&fil_obj);
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_5, "File Closing:Success"); 
  else
    LCD_DisplayStringLine(LCD_LINE_5, "File Closing:Failed "); 
  
  res = f_unlink("stm32_logs");  
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_6, "Dir Deleting:Success"); 
  else
    LCD_DisplayStringLine(LCD_LINE_6, "Dir Deleting:Failed "); 

  res = f_mkdir("stm32_logs");  
  if(res == FR_OK)
    LCD_DisplayStringLine(LCD_LINE_7, "Dir Creating:Success"); 
  else
    LCD_DisplayStringLine(LCD_LINE_7, "Dir Creating:Failed "); 
  
  // /* unregister work area */
  // f_mount(0, NULL); 
}

/**
  * @brief  Retargets the C library printf function to the USART or USB.
  * @param  None
  * @retval None
  */
PUTCHAR_PROTOTYPE
{
  //Do nothing for now
  return ch;
}

// /*-----------------------------------------------------------------------*/
// /* Get current time                                                      */
// /*-----------------------------------------------------------------------*/
// DWORD get_fattime ()
// {
	// return	((2008UL-1980) << 25)	      // Year = 2008
			// | (4UL << 21)	      // Month = April
			// | (18L << 16)	      // Day = 18
			// | (16U << 11)	      // Hour = 16
			// | (30U << 5)	      // Min = 30
			// | (0U >> 1)	      // Sec = 0
			// ;
// }

#ifdef USE_DAC_SIGNALGEN 
void Start_SIGNALGEN_Data_Acquisition(void)
{
    char TraceMenu[5][6] = {"+Freq","-Freq","PAUSE","IIROF","EXIT "};
    int TraceMenuItems = 5, TraceMenuItemIndex = 0, MyKey = 0;

    uint8_t dataLogFileName[_MAX_LFN - 1];    //Year(4)+Month(2)+Day(2)+Hour(2)+Min(2)+Sec(2)+Ext(4)+NULL(1)

    /* ADC Configuration */
    Data_Channel[0] = VBAT_AIN_CHANNEL;
    Data_Channel_Trace_Enabled[0] = 0;
    Data_Channel_Filter_Enabled[0] = 0;
    prevData[0] = 0;

    Data_Channel[DATA_CHANNELS - 1] = SIGNALGEN_AIN_CHANNEL;
    Data_Channel_Trace_Enabled[DATA_CHANNELS - 1] = 1;
    Data_Channel_Filter_Enabled[DATA_CHANNELS - 1] = 1;
    prevData[DATA_CHANNELS - 1] = traceYPos + traceHeight/2;

    traceOffset = traceXPos;

    xv[0] = xv[1] = xv[2] = xv[3] = xv[4] = 0;
    yv[0] = yv[1] = yv[2] = yv[3] = yv[4] = 0;

