satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Pre_Alpha/src/hw_config.c
/*
    xv_bp1[0] = xv_bp1[1] = xv_bp1[2] = 0;
    yv_bp1[0] = yv_bp1[1] = yv_bp1[2] = 0;
    xv_bp2[0] = xv_bp2[1] = xv_bp2[2] = 0;
    yv_bp2[0] = yv_bp2[1] = yv_bp2[2] = 0;
    xv_bp3[0] = xv_bp3[1] = xv_bp3[2] = 0;
    yv_bp3[0] = yv_bp3[1] = yv_bp3[2] = 0;
    xv_bp4[0] = xv_bp4[1] = xv_bp4[2] = 0;
    yv_bp4[0] = yv_bp4[1] = yv_bp4[2] = 0;
    xv_bp5[0] = xv_bp5[1] = xv_bp5[2] = 0;
    yv_bp5[0] = yv_bp5[1] = yv_bp5[2] = 0;
    xv_bp6[0] = xv_bp6[1] = xv_bp6[2] = 0;
    yv_bp6[0] = yv_bp6[1] = yv_bp6[2] = 0;
*/

    filter_type = 1;
    scale_factor = 1;
#ifdef USE_ADC_OVERSAMPLING
    filter_offset = 16384;
#else
    filter_offset = 2048;
#endif

    /* Feature Flags */
    DRAW_LCD_TRACE_ENABLED = 1;
    ADC_DMA_TIM_ENABLED = 0;
    DAC_DMA_TIM_ENABLED = 0;
    FILTER_ENABLED = 1;
    DATA_LOGGING_ENABLED = 0;

    DETECT_DISPLAY_HR_ENABLED = 0;

    /* Disable the JoyStick interrupts */
    IntExtOnOffConfig(DISABLE);

    EnterAutoShutdownMode_RTCAlarm(DISABLE);

    LCD_SetBackLight(LCD_BRIGHTNESS_MEDIUM);

    /* Clear the LCD */
    LCD_Clear(LCD_COLOR_WHITE);

    if (BKP_ReadBackupRegister(BKP_DR1) != 0xA5A5)
    {
        LCD_DisplayStringLine(LCD_LINE_5, "Please Configure    ");
        LCD_DisplayStringLine(LCD_LINE_6, "Time and Date       ");
        LCD_DisplayStringLine(LCD_LINE_7, "Exit: Press Any Key ");

        while (Menu_ReadKey() == NOKEY)
        {
        }

        LCD_SetBackLight(LCD_BRIGHTNESS_NIL);
    
        /* Display Main Menu */
        Menu_ReturnMainMenu();
        // /* Clear the LCD */
        // LCD_Clear(LCD_COLOR_WHITE);
        // /* Display the menu */
        // Menu_DisplayMenu();
        /* Enable the JoyStick interrupts */
        IntExtOnOffConfig(ENABLE);
        return;
    }

    LCD_DrawRect(traceXPos-1, traceYPos-1, LCD_WIDTH, LCD_HEIGHT, LCD_COLOR_BLACK);
    LCD_DrawLine(traceXPos+traceWidth, traceYPos-1, traceXPos+traceWidth, LCD_HEIGHT, LCD_COLOR_BLACK);
    
    for(TraceMenuItemIndex = 0; TraceMenuItemIndex < TraceMenuItems; TraceMenuItemIndex++)
    {
        if(TraceMenuItemIndex == 0)
            LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
        else
            LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);         
        LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
        if(TraceMenuItemIndex == 0)
        {
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
        }
    }  
    LCD_DrawLine(traceXPos+traceWidth+1, traceYPos-1, LCD_WIDTH, traceYPos-1, LCD_COLOR_BLACK);

    LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
    LCD_DisplayStringLineColumn(LCD_LINE_0, traceXPos+traceWidth+2, "   Hz", 5);                    
    if(SineFreqTable[SineFreqIndex]/10)
    {
        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_16, ((SineFreqTable[SineFreqIndex]/10)+ 0x30));
        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_17, ((SineFreqTable[SineFreqIndex]%10)+ 0x30));
    }
    else
    {
        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_17, ((SineFreqTable[SineFreqIndex]%10)+ 0x30));
    }                
    LCD_DrawRect(traceXPos+traceWidth+1, LCD_LINE_0*8, 32, 9, LCD_COLOR_BLACK);

    /* create datetime file name */
    Create_Date_Time_Filename(dataLogFileName, ".dat");
    
    /* open file with write permission */
    res = f_open(&DATA_LOG_FIL_Obj, dataLogFileName, FA_CREATE_ALWAYS | FA_WRITE); 
    
    /*
    LCD_DisplayStringLineColumn(LCD_LINE_0, LCD_COLUMN_0, dataLogFileName, 20);
    if(res == FR_OK)
        LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Open File : Success", 20); 
    else
        LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Open File : Failed", 20);   
    */

    if(res == FR_OK)
        DATA_LOGGING_ENABLED = 1;

    if(DATA_LOGGING_ENABLED)
    {
        /* Write Data_Channel[DATA_CHANNELS] to log file */    
        res = f_write(&DATA_LOG_FIL_Obj, Data_Channel, DATA_CHANNELS, &bytesWritten);
        // res = f_sync(&DATA_LOG_FIL_Obj);
    }            
    
    /* Configure the ADC */
    ADC_DMA_TIM_Configuration(ENABLE);
    ADC_DMA_TIM_ENABLED = 1;

    /* Configure the DAC */
    DAC_DMA_TIM_Configuration(ENABLE);  
    DAC_DMA_TIM_ENABLED = 1;

    TraceMenuItemIndex = 0;
    while(1)
    {        
        /* Check which key is pressed */
        MyKey = Menu_ReadKey();

        /* If "MENU" pushbutton is pressed */
        if(MyKey == MENU)
        {
            break;
        }                  
    
        /* If "UP" pushbutton is pressed */
        if(MyKey == UP)
        {
            DRAW_LCD_TRACE_ENABLED = 0;
        
            LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_WHITE);
        
            if(TraceMenuItemIndex > 0)
            {
                TraceMenuItemIndex--;
            }
            else
            {
                TraceMenuItemIndex = (TraceMenuItems - 1);
            }

            LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            LCD_DrawLine(traceXPos+traceWidth+1, traceYPos-1, LCD_WIDTH, traceYPos-1, LCD_COLOR_BLACK);
        
            DRAW_LCD_TRACE_ENABLED = 1;        
        }

        /* If "DOWN" pushbutton is pressed */
        if(MyKey == DOWN)
        {
            DRAW_LCD_TRACE_ENABLED = 0;
        
            LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_WHITE);

            if(TraceMenuItemIndex >= (TraceMenuItems - 1))
            {
                TraceMenuItemIndex = 0;
            }
            else
            {
                TraceMenuItemIndex++;
            }

            LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            LCD_DrawLine(traceXPos+traceWidth+1, traceYPos-1, LCD_WIDTH, traceYPos-1, LCD_COLOR_BLACK);
        
