satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Pre_Alpha/src/hw_config.c
            DRAW_LCD_TRACE_ENABLED = 1;        
        }

        /* If "SEL" pushbutton is pressed */
        if(MyKey == SEL)
        {
            DRAW_LCD_TRACE_ENABLED = 0;
        
            if(TraceMenuItemIndex == 0)
            {
                if(SineFreqIndex < 5)
                {
                    /* Stop DAC */
                    TIM_Cmd(TIM7, DISABLE);
                    DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, DISABLE);
                    DAC_DMA_TIM_ENABLED = 0;
                
                    SineFreqIndex++;
                    TIM7->ARR = (1000 / SineFreqTable[SineFreqIndex]) - 1; 
                
                    LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
                    LCD_DisplayStringLineColumn(LCD_LINE_0, traceXPos+traceWidth+2, "   Hz", 5);                    
                    if(SineFreqTable[SineFreqIndex]/10)
                    {
                        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_16, ((SineFreqTable[SineFreqIndex]/10)+ 0x30));
                        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_17, ((SineFreqTable[SineFreqIndex]%10)+ 0x30));
                    }
                    else
                    {
                        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_17, ((SineFreqTable[SineFreqIndex]%10)+ 0x30));
                    }                
                    LCD_DrawRect(traceXPos+traceWidth+1, LCD_LINE_0*8, 32, 9, LCD_COLOR_BLACK);
                
                    /* Start DAC */                
                    DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, ENABLE);
                    TIM_Cmd(TIM7, ENABLE);
                    DAC_DMA_TIM_ENABLED = 1;  
                }                
            }        
            else if(TraceMenuItemIndex == 1)
            {
                if(SineFreqIndex > 0)
                {
                    /* Stop DAC */
                    TIM_Cmd(TIM7, DISABLE);
                    DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, DISABLE);
                    DAC_DMA_TIM_ENABLED = 0;
                
                    SineFreqIndex--;
                    TIM7->ARR = (1000 / SineFreqTable[SineFreqIndex]) - 1; 
                
                    LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
                    LCD_DisplayStringLineColumn(LCD_LINE_0, traceXPos+traceWidth+2, "   Hz", 5);                    
                    if(SineFreqTable[SineFreqIndex]/10)
                    {
                        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_16, ((SineFreqTable[SineFreqIndex]/10)+ 0x30));
                        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_17, ((SineFreqTable[SineFreqIndex]%10)+ 0x30));
                    }
                    else
                    {
                        LCD_DisplayChar(LCD_LINE_0, LCD_COLUMN_17, ((SineFreqTable[SineFreqIndex]%10)+ 0x30));
                    }                
                    LCD_DrawRect(traceXPos+traceWidth+1, LCD_LINE_0*8, 32, 9, LCD_COLOR_BLACK);

                    /* Start DAC */                
                    DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, ENABLE);
                    TIM_Cmd(TIM7, ENABLE);
                    DAC_DMA_TIM_ENABLED = 1;  
                }                
            }        
            else if(TraceMenuItemIndex == 2)
            {
                LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);            
                if(DAC_DMA_TIM_ENABLED || ADC_DMA_TIM_ENABLED)
                {                     
                    /* Stop DAC */
                    TIM_Cmd(TIM7, DISABLE);
                    DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, DISABLE);

                    /* Stop ADC */
                    TIM_Cmd(TIM3, DISABLE);
                
                    strncpy(TraceMenu[TraceMenuItemIndex],"PLAY ",5);
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    DAC_DMA_TIM_ENABLED = 0;
                    ADC_DMA_TIM_ENABLED = 0;                
                }
                else
                {
                    /* Start ADC */
                    TIM_Cmd(TIM3, ENABLE);
                
                    /* Start DAC */                
                    DAC_Cmd(SIGNALGEN_AOUT_CHANNEL, ENABLE);
                    TIM_Cmd(TIM7, ENABLE);
                                   
                    strncpy(TraceMenu[TraceMenuItemIndex],"PAUSE",5); 
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
                
                    ADC_DMA_TIM_ENABLED = 1;
                    DAC_DMA_TIM_ENABLED = 1;                                    
                }
                LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            }
            else if(TraceMenuItemIndex == 3)
            {
                LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);            
                if(FILTER_ENABLED)
                {                
                    strncpy(TraceMenu[TraceMenuItemIndex],"IIRON",5);                
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    FILTER_ENABLED = 0;                               
                }
                else
                {
                    strncpy(TraceMenu[TraceMenuItemIndex],"IIROF",5);  
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    FILTER_ENABLED = 1;                  
                }
                LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            }
            else if(TraceMenuItemIndex == 4)
            {
                break;
            }       
        
            DRAW_LCD_TRACE_ENABLED = 1;        
        } 
    
        if (DATA_LOGGING_ENABLED && (res || dataLogBytesWritten < DMA_DATA_BUFF_SIZE))
        {                  
            /*
            LCD_DisplayStringLineColumn(LCD_LINE_0, LCD_COLUMN_0, dataLogFileName, 20);        
            LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Error or Disk Full", 20); 
            */
            DATA_LOGGING_ENABLED = 0;        
        }
    }

    DAC_DMA_TIM_Configuration(DISABLE);  
    ADC_DMA_TIM_Configuration(DISABLE);
        
