satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Pre_Alpha/src/hw_config.c
    /* close the file, writes cached content to disk */
    res = f_close(&DATA_LOG_FIL_Obj);
        
    /*
    LCD_DisplayStringLineColumn(LCD_LINE_0, LCD_COLUMN_0, dataLogFileName, 20);
    if(res == FR_OK)
        LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Close File : Success", 20); 
    else
        LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Close File : Failed", 20); 
    */

    LCD_SetBackLight(LCD_BRIGHTNESS_NIL);

    /* Display Main Menu */
    Menu_ReturnMainMenu();
    // /* Clear the LCD */
    // LCD_Clear(LCD_COLOR_WHITE);
    // /* Display the menu */
    // Menu_DisplayMenu();
    /* Enable the JoyStick interrupts */
    IntExtOnOffConfig(ENABLE);
}
#endif

void Start_ECG_Data_Acquisition(void)
{
    char TraceMenu[4][6] = {"PAUSE","IIROF","MULx2","EXIT "};
    int TraceMenuItems = 4, TraceMenuItemIndex = 0, MyKey = 0;

    uint8_t dataLogFileName[_MAX_LFN - 1];    //Year(4)+Month(2)+Day(2)+Hour(2)+Min(2)+Sec(2)+Ext(4)+NULL(1)

    /* ADC Configuration */
    Data_Channel[0] = VBAT_AIN_CHANNEL;
    Data_Channel_Trace_Enabled[0] = 0;
    Data_Channel_Filter_Enabled[0] = 0;
    prevData[0] = 0;

    Data_Channel[DATA_CHANNELS - 1] = ECG_AIN_CHANNEL;
    Data_Channel_Trace_Enabled[DATA_CHANNELS - 1] = 1;
    Data_Channel_Filter_Enabled[DATA_CHANNELS - 1] = 1;
    prevData[DATA_CHANNELS - 1] = traceYPos + traceHeight/2;

    traceOffset = traceXPos;

#if defined (USE_DAC_VGND) || defined (USE_DAC_IA_REF)
    DAC_Channel1_Data = 2048; //Virtual Ground Half Supply
#endif

    xv[0] = xv[1] = xv[2] = xv[3] = xv[4] = 0;
    yv[0] = yv[1] = yv[2] = yv[3] = yv[4] = 0;

/*
    xv_bp1[0] = xv_bp1[1] = xv_bp1[2] = 0;
    yv_bp1[0] = yv_bp1[1] = yv_bp1[2] = 0;
    xv_bp2[0] = xv_bp2[1] = xv_bp2[2] = 0;
    yv_bp2[0] = yv_bp2[1] = yv_bp2[2] = 0;
    xv_bp3[0] = xv_bp3[1] = xv_bp3[2] = 0;
    yv_bp3[0] = yv_bp3[1] = yv_bp3[2] = 0;
    xv_bp4[0] = xv_bp4[1] = xv_bp4[2] = 0;
    yv_bp4[0] = yv_bp4[1] = yv_bp4[2] = 0;
    xv_bp5[0] = xv_bp5[1] = xv_bp5[2] = 0;
    yv_bp5[0] = yv_bp5[1] = yv_bp5[2] = 0;
    xv_bp6[0] = xv_bp6[1] = xv_bp6[2] = 0;
    yv_bp6[0] = yv_bp6[1] = yv_bp6[2] = 0;
*/

#ifdef USE_DAC_IA_REF  
    filter_type = 2;
    scale_factor = 100;
#else
    filter_type = 1;
    scale_factor = 1;
#endif
#ifdef USE_ADC_OVERSAMPLING
    filter_offset = 16384;
#else
    filter_offset = 2048;
#endif

    /* Feature Flags */
    DRAW_LCD_TRACE_ENABLED = 1;
    ADC_DMA_TIM_ENABLED = 0;
    FILTER_ENABLED = 1;
    DATA_LOGGING_ENABLED = 0;
    
    DETECT_DISPLAY_HR_ENABLED = 1;
    QRS_Upper_Threshold = 40;
    QRS_Lower_Threshold = 30;
    QRS_Detect = 0;
    QRS_Interval = 0;
    Heart_Rate = 0;

    /* Disable the JoyStick interrupts */
    IntExtOnOffConfig(DISABLE);

    EnterAutoShutdownMode_RTCAlarm(DISABLE);

    LCD_SetBackLight(LCD_BRIGHTNESS_MEDIUM);

    /* Clear the LCD */
    LCD_Clear(LCD_COLOR_WHITE);

    if (BKP_ReadBackupRegister(BKP_DR1) != 0xA5A5)
    {
        LCD_DisplayStringLine(LCD_LINE_5, "Please Configure    ");
        LCD_DisplayStringLine(LCD_LINE_6, "Time and Date       ");
        LCD_DisplayStringLine(LCD_LINE_7, "Exit: Press Any Key ");

        while (Menu_ReadKey() == NOKEY)
        {
        }

        LCD_SetBackLight(LCD_BRIGHTNESS_NIL);
    
        /* Display Main Menu */
        Menu_ReturnMainMenu();
        // /* Clear the LCD */
        // LCD_Clear(LCD_COLOR_WHITE);
        // /* Display the menu */
        // Menu_DisplayMenu();
        /* Enable the JoyStick interrupts */
        IntExtOnOffConfig(ENABLE);
        return;
    }

    LCD_DrawRect(traceXPos-1, traceYPos-1, LCD_WIDTH, LCD_HEIGHT, LCD_COLOR_BLACK);
    LCD_DrawLine(traceXPos+traceWidth, traceYPos-1, traceXPos+traceWidth, LCD_HEIGHT, LCD_COLOR_BLACK);
    
    for(TraceMenuItemIndex = 0; TraceMenuItemIndex < TraceMenuItems; TraceMenuItemIndex++)
    {
        if(TraceMenuItemIndex == 0)
            LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
        else
            LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);         
        LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
        if(TraceMenuItemIndex == 0)
        {
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
        }
    }  
    LCD_DrawLine(traceXPos+traceWidth+1, traceYPos-1, LCD_WIDTH, traceYPos-1, LCD_COLOR_BLACK);

    /* create datetime file name */
    Create_Date_Time_Filename(dataLogFileName, ".dat");
    
    /* open file with write permission */
    res = f_open(&DATA_LOG_FIL_Obj, dataLogFileName, FA_CREATE_ALWAYS | FA_WRITE); 
    
    /*
    LCD_DisplayStringLineColumn(LCD_LINE_0, LCD_COLUMN_0, dataLogFileName, 20);
    if(res == FR_OK)
        LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Open File : Success", 20); 
    else
        LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Open File : Failed", 20);   
    */

    if(res == FR_OK)
        DATA_LOGGING_ENABLED = 1;

    if(DATA_LOGGING_ENABLED)
    {
        /* Write Data_Channel[DATA_CHANNELS] to log file */    
        res = f_write(&DATA_LOG_FIL_Obj, Data_Channel, DATA_CHANNELS, &bytesWritten);
        // res = f_sync(&DATA_LOG_FIL_Obj);
    }            
    
    /* Configure the ADC */
    ADC_DMA_TIM_Configuration(ENABLE);
    ADC_DMA_TIM_ENABLED = 1;

#ifdef USE_ANALOG_POWER_SWITCH
    Analog_Power(ENABLE);
#endif
    
#if defined (USE_DAC_VGND) || defined (USE_DAC_IA_REF)
    DAC_Configuration(ENABLE);
#endif

    TraceMenuItemIndex = 0;
    while(1)
    {        
        /* Check which key is pressed */
        MyKey = Menu_ReadKey();

        /* If "MENU" pushbutton is pressed */
        if(MyKey == MENU)
        {
            break;
        }                  
    
        /* If "UP" pushbutton is pressed */
        if(MyKey == UP)
        {
            DRAW_LCD_TRACE_ENABLED = 0;
        
            LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_WHITE);

