satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Pre_Alpha/src/hw_config.c
            if(TraceMenuItemIndex > 0)
            {
                TraceMenuItemIndex--;
            }
            else
            {
                TraceMenuItemIndex = (TraceMenuItems - 1);
            }

            LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            LCD_DrawLine(traceXPos+traceWidth+1, traceYPos-1, LCD_WIDTH, traceYPos-1, LCD_COLOR_BLACK);
        
            DRAW_LCD_TRACE_ENABLED = 1;        
        }

        /* If "DOWN" pushbutton is pressed */
        if(MyKey == DOWN)
        {
            DRAW_LCD_TRACE_ENABLED = 0;
        
            LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_WHITE);

            if(TraceMenuItemIndex >= (TraceMenuItems - 1))
            {
                TraceMenuItemIndex = 0;
            }
            else
            {
                TraceMenuItemIndex++;
            }

            LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            LCD_DrawLine(traceXPos+traceWidth+1, traceYPos-1, LCD_WIDTH, traceYPos-1, LCD_COLOR_BLACK);
        
            DRAW_LCD_TRACE_ENABLED = 1;        
        }

        /* If "SEL" pushbutton is pressed */
        if(MyKey == SEL)
        {
            DRAW_LCD_TRACE_ENABLED = 0;
        
            if(TraceMenuItemIndex == 0)
            {            
                LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);            
                if(ADC_DMA_TIM_ENABLED)
                {                     
                    /* Stop ADC */
                    TIM_Cmd(TIM3, DISABLE);
                
                    strncpy(TraceMenu[TraceMenuItemIndex],"PLAY ",5);
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    ADC_DMA_TIM_ENABLED = 0;                
                }
                else
                {
                    /* Start ADC */
                    TIM_Cmd(TIM3, ENABLE);
                
                    strncpy(TraceMenu[TraceMenuItemIndex],"PAUSE",5); 
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
                
                    ADC_DMA_TIM_ENABLED = 1;
                }
                LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            }
            else if(TraceMenuItemIndex == 1)
            {
                LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);            
                if(FILTER_ENABLED)
                {                
                    strncpy(TraceMenu[TraceMenuItemIndex],"IIRON",5);                
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    FILTER_ENABLED = 0;                               
                }
                else
                {
                    strncpy(TraceMenu[TraceMenuItemIndex],"IIROF",5);  
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    FILTER_ENABLED = 1;                  
                }
                LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            }
            else if(TraceMenuItemIndex == 2)
            {
                LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);            
                if((scale_factor == 1) || (scale_factor == 100))
                {                
                    strncpy(TraceMenu[TraceMenuItemIndex],"MULx1",5);                
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    scale_factor = scale_factor * 2;   
                }
                else
                {
                    strncpy(TraceMenu[TraceMenuItemIndex],"MULx2",5);  
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    scale_factor = scale_factor / 2;                  
                }
                LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            }
            else if(TraceMenuItemIndex == 3)
            {
                break;
            }            
        
            DRAW_LCD_TRACE_ENABLED = 1;        
        } 
    
        if (DATA_LOGGING_ENABLED && (res || dataLogBytesWritten < DMA_DATA_BUFF_SIZE))
        {                  
            /*
            LCD_DisplayStringLineColumn(LCD_LINE_0, LCD_COLUMN_0, dataLogFileName, 20);        
            LCD_DisplayStringLineColumn(LCD_LINE_1, LCD_COLUMN_0, "Error or Disk Full", 20); 
            */
            DATA_LOGGING_ENABLED = 0;        
        }
    }
  
#if defined (USE_DAC_VGND) || defined (USE_DAC_IA_REF)
    DAC_Configuration(DISABLE);
#endif

#ifdef USE_ANALOG_POWER_SWITCH
    Analog_Power(DISABLE);
#endif

    ADC_DMA_TIM_Configuration(DISABLE);

    /* close the file, writes cached content to disk */
    res = f_close(&DATA_LOG_FIL_Obj);
        
