satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Pre_Alpha/src/hw_config.c
            DRAW_LCD_TRACE_ENABLED = 1;        
        }

        /* If "DOWN" pushbutton is pressed */
        if(MyKey == DOWN)
        {
            DRAW_LCD_TRACE_ENABLED = 0;
        
            LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_WHITE);

            if(TraceMenuItemIndex >= (TraceMenuItems - 1))
            {
                TraceMenuItemIndex = 0;
            }
            else
            {
                TraceMenuItemIndex++;
            }

            LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
            LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    
            LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            LCD_DrawLine(traceXPos+traceWidth+1, traceYPos-1, LCD_WIDTH, traceYPos-1, LCD_COLOR_BLACK);
        
            DRAW_LCD_TRACE_ENABLED = 1;        
        }
    
        /* If "SEL" pushbutton is pressed */
        if(MyKey == SEL)
        {
            DRAW_LCD_TRACE_ENABLED = 0;
        
            if(TraceMenuItemIndex == 0)
            {
                LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);            
                if(ReStart)
                {
                    MEM_DMA_TIM_Configuration(ENABLE);
                
                    strncpy(TraceMenu[TraceMenuItemIndex],"PAUSE",5);  
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    MEM_DMA_TIM_ENABLED = 1;
                    ReStart = 0;                
                }
                else if(MEM_DMA_TIM_ENABLED)
                {
                    /* TIM4 disable counter */
                    TIM_Cmd(TIM4, DISABLE);
                
                    strncpy(TraceMenu[TraceMenuItemIndex],"PLAY ",5);
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    MEM_DMA_TIM_ENABLED = 0;
                }
                else
                {
                    /* TIM4 enable counter */
                    TIM_Cmd(TIM4, ENABLE);
                
                    strncpy(TraceMenu[TraceMenuItemIndex],"PAUSE",5);  
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    MEM_DMA_TIM_ENABLED = 1;
                }
                LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            }
            else if(TraceMenuItemIndex == 1)
            {
                LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);            
                if(FILTER_ENABLED)
                {                
                    strncpy(TraceMenu[TraceMenuItemIndex],"IIRON",5);                
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    FILTER_ENABLED = 0;   
                }
                else
                {
                    strncpy(TraceMenu[TraceMenuItemIndex],"IIROF",5);  
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    FILTER_ENABLED = 1;                  
                }
                LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            }
            else if(TraceMenuItemIndex == 2)
            {
                LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);            
                if((scale_factor == 1) || (scale_factor == 100))
                {                
                    strncpy(TraceMenu[TraceMenuItemIndex],"MULx1",5);                
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    scale_factor = scale_factor * 2;   
                }
                else
                {
                    strncpy(TraceMenu[TraceMenuItemIndex],"MULx2",5);  
                    LCD_DisplayStringLineColumn(TraceMenuItems-TraceMenuItemIndex-1, traceXPos+traceWidth+2, TraceMenu[TraceMenuItemIndex], 5);    

                    scale_factor = scale_factor / 2;                  
                }
                LCD_DrawRect(traceXPos+traceWidth+1, (TraceMenuItems-TraceMenuItemIndex-1)*8, 32, 9, LCD_COLOR_BLACK);
            }
            else if(TraceMenuItemIndex == 3)
            {
                MEM_DMA_TIM_Configuration(DISABLE);

                /* close the file, writes cached content to disk */
                f_close(&DATA_LOG_FIL_Obj);
            
                /* delete the file */
                res = f_unlink(logFile);
            
                strncpy(logFile,"--------deleted---------",_MAX_LFN - 2);
            
                return;
            }
            else if(TraceMenuItemIndex == 4)
            {
                break;
            }            
        
            DRAW_LCD_TRACE_ENABLED = 1;        
        } 

        if(MEM_DMA_TIM_ENABLED && (res || dataLogBytesReadHT==0 || dataLogBytesReadTC==0))
        {
            MEM_DMA_TIM_Configuration(DISABLE);
        
            strncpy(TraceMenu[0],"PLAY ",5);
            if(TraceMenuItemIndex == 0)
                LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
            else
                LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);         
            LCD_DisplayStringLineColumn(LCD_LINE_3, traceXPos+traceWidth+2, TraceMenu[0], 5);    
            if(TraceMenuItemIndex == 0)
            {
                LCD_DrawRect(traceXPos+traceWidth+1, LCD_LINE_3*8, 32, 9, LCD_COLOR_BLACK);            
            }
               
            f_lseek(&DATA_LOG_FIL_Obj, 0); 
        
