satishgn/yantronix-stm32-ecg-prototype/STM32_Embedded_Firmware/Project/Yantronix_ECG_Pre_Alpha/src/hw_config.c
void Draw_LCD_Trace(uint16_t *dataBuffer)
{
    uint16_t *pWork = dataBuffer;

    if(traceOffset >= (traceXPos + traceWidth))
        traceOffset = traceXPos;

    /* Erase the area */
    LCD_DrawLine(traceOffset, traceYPos, traceOffset, traceHeight, traceBackColor);
    
    for(Data_Channel_Index = 0; Data_Channel_Index < DATA_CHANNELS; Data_Channel_Index++, pWork++)
    {
        if(!Data_Channel_Trace_Enabled[Data_Channel_Index])
            continue;

#ifdef USE_ADC_OVERSAMPLING    
        *pWork = *pWork>>9; //6+ADC_ADDITIONAL_BITS
#else
        *pWork = *pWork>>6;    
#endif
    
        if(*pWork > traceHeight)
            *pWork = traceHeight;
        else if(*pWork < traceYPos)
            *pWork = traceYPos;
                
        /* Draw data */
        LCD_DrawLine(traceOffset, prevData[Data_Channel_Index], traceOffset, *pWork, traceColor);

        if((Data_Channel[Data_Channel_Index] == ECG_AIN_CHANNEL) && DETECT_DISPLAY_HR_ENABLED)
            Detect_Display_HR(*pWork);
        
        prevData[Data_Channel_Index] = *pWork;
    }
    traceOffset++;            
}

void Detect_Display_HR(uint16_t dataSample)
{
    if((dataSample == traceHeight) || (dataSample == traceYPos))
    {
        QRS_Detect = 0;
        QRS_Interval = 0;
        Heart_Rate = 0;
 
        LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
        LCD_DisplayStringLineColumn(LCD_LINE_1, traceXPos+traceWidth+2, "     ", 5);   
        return;
    }

    if( !QRS_Detect )                                          // detect QRS wave
    {
#ifdef QRS_DETECT_LED_OUT     
        /* Turn off LED2 */
        GPIO_SetBits(GPIO_LED, GPIO_LED2_PIN);
#endif
#ifdef QRS_DETECT_BUZZER_OUT     
        /* Turn off Buzzer */
        GPIO_SetBits(GPIO_BUZZER, GPIO_BUZZER_PIN);
#endif
    
        ++QRS_Interval;
        if( dataSample >= QRS_Upper_Threshold && QRS_Interval > 50 )   // HR must < 150/min  [(ADC_Sampling_Freq * 60)/150 = 50]
        {
#ifdef QRS_DETECT_LED_OUT     
            /* Turn on LED2 */
            GPIO_ResetBits(GPIO_LED, GPIO_LED2_PIN);
#endif
#ifdef QRS_DETECT_BUZZER_OUT     
            /* Turn on Buzzer */
            GPIO_ResetBits(GPIO_BUZZER, GPIO_BUZZER_PIN);
#endif

            Heart_Rate = 7500 / QRS_Interval;                     // 1 minute has (ADC_Sampling_Freq * 60) = 7500 samples
            QRS_Detect = 1;
    
            LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
            LCD_DisplayStringLineColumn(LCD_LINE_1, traceXPos+traceWidth+2, "     ", 5);                    
            if (Heart_Rate / 100)
            {
                LCD_DisplayChar(LCD_LINE_1, LCD_COLUMN_17, ((Heart_Rate / 100) + 0x30));
                LCD_DisplayChar(LCD_LINE_1, LCD_COLUMN_18, (((Heart_Rate % 100) / 10) + 0x30));
                LCD_DisplayChar(LCD_LINE_1, LCD_COLUMN_19, (((Heart_Rate % 100) % 10) + 0x30));
            }
            else if (Heart_Rate / 10)
            {
                LCD_DisplayChar(LCD_LINE_1, LCD_COLUMN_18, ((Heart_Rate / 10) + 0x30));
                LCD_DisplayChar(LCD_LINE_1, LCD_COLUMN_19, ((Heart_Rate % 10) + 0x30));
            }
            else
            {
                LCD_DisplayChar(LCD_LINE_1, LCD_COLUMN_19, ((Heart_Rate % 10) + 0x30));
            }        
        }
    }

    if( QRS_Detect )                                           // make sure the QRS wave return below threshold
    {
        if( dataSample < QRS_Lower_Threshold )
        {
            QRS_Detect = 0;
            QRS_Interval = 0;            
        }
    }

#ifdef QRS_THRESHOLD_LCD_DISPLAY 
    LCD_DrawLine(traceOffset, QRS_Upper_Threshold, traceOffset, QRS_Upper_Threshold, traceColor);
    LCD_DrawLine(traceOffset, QRS_Lower_Threshold, traceOffset, QRS_Lower_Threshold, traceColor);
#endif
}

void Start_Battery_Monitor(void)
{
    uint16_t VBat = 0;
    uint16_t i = 0;
    uint32_t ADCConvertedValue = 0;

    LCD_Clear(LCD_COLOR_WHITE);
    IntExtOnOffConfig(DISABLE);
    LCD_SetTextColor(LCD_COLOR_TEXT_REVERSE);
    LCD_DisplayStringLine(LCD_LINE_0, "   Battery Voltage  ");    
    LCD_SetTextColor(LCD_COLOR_TEXT_NORMAL);
    LCD_DisplayStringLine(LCD_LINE_4, "            mV      ");    

    ADC_Configuration(ENABLE);

    /* ADC1 regular channel configuration */ 
    ADC_RegularChannelConfig(ADC1, VBAT_AIN_CHANNEL, 1, ADC_SampleTime_1Cycles5);

#ifdef USE_ADC_OVERSAMPLING    
    for(;;)
    {  
        /* Start the conversion */
        ADC_SoftwareStartConvCmd(ADC1, ENABLE);
        /* Wait until conversion completion */
        while(ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);
        /* Convert the conversion values to battery voltage */
        ADCConvertedValue += ADC_GetConversionValue(ADC1);
        if(i == ADC_OVERSAMPLING_FACTOR)
        {
            ADCConvertedValue = (uint16_t)(ADCConvertedValue >> ADC_ADDITIONAL_BITS);
            VBat = (ADCConvertedValue * ADC_VDDA_VOLTAGE_MV) / 32768;
            VBat *= 2; //Divider bridge  VBAT <-> 1M -<--|-->- 1M <-> GND,        
            break;
        }
        i++;
    }
#else
    /* Start the conversion */
    ADC_SoftwareStartConvCmd(ADC1, ENABLE);
    /* Wait until conversion completion */
    while(ADC_GetFlagStatus(ADC1, ADC_FLAG_EOC) == RESET);
    /* Convert the conversion values to battery voltage */
    ADCConvertedValue = ADC_GetConversionValue(ADC1);
    VBat = (ADCConvertedValue * ADC_VDDA_VOLTAGE_MV) / 4096;
    VBat *= 2; //Divider bridge  VBAT <-> 1M -<--|-->- 1M <-> GND,        
#endif

    LCD_DisplayChar(LCD_LINE_4, LCD_COLUMN_7, ((VBat / 1000) + 0x30));
    LCD_DisplayChar(LCD_LINE_4, LCD_COLUMN_8, (((VBat % 1000) / 100) + 0x30));
    LCD_DisplayChar(LCD_LINE_4, LCD_COLUMN_9, ((((VBat % 1000) % 100) / 10) + 0x30));
    LCD_DisplayChar(LCD_LINE_4, LCD_COLUMN_10, ((((VBat % 1000) % 100) % 10) + 0x30));

    /* Display Battery Voltage Graphics here */

    ADC_Configuration(DISABLE);

    while (Menu_ReadKey() == NOKEY)
    {
    }

    LCD_Clear(LCD_COLOR_WHITE);
    Menu_DisplayMenu();
    IntExtOnOffConfig(ENABLE);
}

/******************* (C) COPYRIGHT 2010 STMicroelectronics *****END OF FILE****/
